jjjoshzhang/stm32/labs/usart.c

void My_USART_sendBytes(USART_TypeDef* USARTx,uint8_t *pData, uint16_t size);

#include "stm32f10x.h"

int main(void){


// open GPIO for USART(DEFAULT)


// TX PA9(FROM  DATASHEET)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
  
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_10MHz;

    GPIO_Init(GPIOA, &GPIO_InitStruct);


// RX PA10
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStruct);


// open USART

RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

USART_InitTypeDef USART_InitStruct = {0};
USART_InitStruct.USART_BaudRate = 115200;
USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;// both transmit and receive
USART_InitStruct.USART_WordLength = USART_WordLength_8b;
USART_InitStruct.USART_StopBits = USART_StopBits_1;
USART_InitStruct.USART_Parity = USART_Parity_No;


USART_Init(USART1, &USART_InitStruct);

USART_Cmd(USART1,ENABLE);


for(;;){
    
    // if(USART_GetFlagStatus(USART1,USART_FLAG_TXE)== SET){ // if correct, transmit data register is empty 

   // }if(USART_GetFlagStatus(USART1,USART_FLAG_TC)== SET){// if correct, transmit compeleted 

   // }

   // USART_SendData(USART1,0x01); // send uint16_t data to transmit data register

}


void My_USART_sendBytes(USART_TypeDef* USARTx,uint8_t *pData, uint16_t size){ // pdata is an array
    for(uint_32 i =0; i<size; i++){
        // wait till transmit register is empty
        while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)== RESET);
            USART_SendData(USART1,pData[i]);
    }
    while(USART_GetFlagStatus(USART1,USART_FLAG_TC)== RESET);
}
}







// REMAp



#include "stm32f10x.h"

int main(void){


// open GPIO for USART(REMAP)

       

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_USART1,ENABLE);


    // TX PB6(FROM  DATASHEET)
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_10MHz;

    GPIO_Init(GPIOB, &GPIO_InitStruct);


// RX PB7
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOB, &GPIO_InitStruct);


// open USART

RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

USART_InitTypeDef USART_InitStruct = {0};
USART_InitStruct.USART_BaudRate = 115200;
USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;// both transmit and receive
USART_InitStruct.USART_WordLength = USART_WordLength_8b;
USART_InitStruct.USART_StopBits = USART_StopBits_1;
USART_InitStruct.USART_Parity = USART_Parity_No;


USART_Init(USART1, &USART_InitStruct);

USART_Cmd(USART1,ENABLE);




for(;;){

}
}

